---
kind: other
id: Properties.T:Autodesk.Revit.DB.LayoutRuleFixedDistance
source: html/fabeb690-3479-bbb5-a69a-6a3879eb4d63.htm
---
# LayoutRuleFixedDistance Properties

Identifies if the object is read-only or modifiable.